Revit 2022 API
ParameterUtils Methods
The ParameterUtils type exposes the following members.
Methods
Name | Description
GetAllBuiltInGroups
 Gets the identifiers of all built-in parameter groups.
GetAllBuiltInParameters
 Gets the identifiers of all built-in parameters.
GetBuiltInParameter |  Obsolete.
 Gets the BuiltInParameter value corresponding to built-in parameter identified by the given ForgeTypeId.
GetBuiltInParameterGroup |  Obsolete.
 Gets the BuiltInParameterGroup value corresponding to built-in parameter group identified by the given ForgeTypeId.
GetParameterGroupTypeId |  Obsolete.
 Gets the ForgeTypeId identifying the built-in parameter group corresponding to BuiltInParameterGroup value.
GetParameterTypeId |  Obsolete.
 Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
IsBuiltInGroup
 Checks whether a ForgeTypeId identifies a built-in parameter group.
IsBuiltInParameter
 Checks whether a ForgeTypeId identifies a built-in parameter.
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace